export const CODE = {
  /***********************前端自定义提示码***********************/
  /*********http错误码************/
  '400': '由于语法错误，该请求无法完成',
  '401': '未经授权服务器拒绝响应',
  '403': '已禁止服务器拒绝响应',
  '404': '请求错误或没权限，请联系客服人员',
  '405': '请求不被允许或者使用了不支持的请求方法进行了请求',
  '406': '不可接受服务器只生成客户端不接受的响应',
  '407': '需要代理身份验证客户端必须先使用代理对自身进行身份验证',
  '408': '请求超时等待请求的服务器超时',
  '409': '由于请求中的冲突，无法完成该请求',
  '410': '请求已过期',
  '411': '请求内容长度不对',
  '412': '前提条件不满足请求中给定的前提条件由服务器评估为 false',
  '413': '请求实体太大服务器不会接受请求，因为请求实体太大',
  '414': '请求 URI 太长服务器不会接受该请求，因为 URL 太长',
  '415': '不支持的媒体类型服务器不会接受该请求，因为媒体类型不受支持',
  '416': 'HTTP 状态代码 {0}',
  '500': '服务器异常或连接不到',
  '501': '服务器不识别或无法完成该请求',
  '503': '服务不可用服务器当前不可用(过载或故障)',
  /*响应成功 统一返回 200*/
  '200': '响应成功',
  /*********无需命名或难以命名的提示语句************/
};
